app/controllers/diccionarios_controller.rb

  def index
    @diccionarios = Diccionario.all
---
SELECT "diccionarios".* FROM "diccionarios"