app/controllers/filtros_controller.rb

  def index
    @filtros = Filtro.all
---
SELECT "filtros".* FROM "filtros"

    def set_filtro
      @filtro = Filtro.find(params[:id])
---
SELECT  "filtros".* FROM "filtros"  WHERE "filtros"."id" = ? LIMIT 1  [["id", 1]]