app/controllers/primaris_controller.rb

    def set_primari
      @primari = Primari.find(params[:id])
---
SELECT  "primaris".* FROM "primaris"  WHERE "primaris"."id" = ? LIMIT 1  [["id", 0]]