app/controllers/reclamos_controller.rb

SELECT "reclamos".* FROM "reclamos"
---
  def index
    @reclamos = Reclamo.all