app/controllers/tweets_controller.rb

  def new
    require 'sqlite3'
    require 'twitter'
    db = SQLite3::Database.open "./db/development.sqlite3"
    client = Twitter::Streaming::Client.new do |config|
      config.consumer_key        = "6lbKKtoGUNt1HqmXp5OTfpnSu"
      config.consumer_secret     = "m0rkrkbmn5sDuXcJFBSJRmrzcEYEBXx95k80nH738JrxdFpl7h"
      config.access_token        = "777522674-swQ5cJqfqSnzf2CCJgDSWLaVkRpr5XogBmyKCQGJ"
      config.access_token_secret = "MQuAZO0kJ4JGxTNYQlsdLgRN02RYHChpMLOBQZt6aRMWv"
    end
    topics=db.execute("select terminos from diccionarios")
    contador = 0
    client.filter(:track => topics.join(",")) do |object|
      if contador >= 1
        break
      else
        if (object.text.start_with?("@"))
          insert_tweet(object)
          insert_usuario(object)
          reclamo(object.text)
          user_tweet(object)
          dic_tweet(object.text)
          #@tweets.push contador
          #@tweets = object.text if object.is_a?(Twitter::Tweet)
        end
      end
      contador += 1
    end
    #@tweet = Tweet.new
    @tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"