app/controllers/usuarios_controller.rb

  def destroy
    db = SQLite3::Database.open "./db/development.sqlite3"
    id=@usuario.id
    id_t=db.execute("select tweet_id from usuario_tweets where usuario_id=(?)",id)
    id_t.each do |i|
      db.execute("delete from tweets where id=(?)",i)
      db.execute("delete from usuario_tweets where tweet_id=(?)",i)
    end
    @usuario.destroy
---
DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 5]]